2018-01-07_22-43-22.064701/effective.yml
---
cli-aliases:
  cloud:
    provisioning: cloud
  detach:
    modules:
      cloud:
        detach: true
  func:
    modules:
      console:
        disable: true
    settings:
      aggregator: functional-consolidator
  gui:
    modules:
      jmeter:
        gui: true
  install-tools:
    services:
    - install-checker
  local:
    provisioning: local
  locations:
    modules:
      cloud:
        dump-locations: true
    provisioning: cloud
  public:
    modules:
      blazemeter:
        public-report: true
  report:
    reporting:
    - blazemeter
  sequential:
    modules:
      local:
        sequential: true
execution:
- concurrency:
    local: 10
  delay: 0
  distributed: []
  executor: jmeter
  files: []
  hold-for: 1m
  iterations: null
  ramp-up: 50s
  scenario: File Upload using REST API
  start-at: 0
  steps: null
  throughput:
    local: null
  write-xml-jtl: error
install-id: macos-acbc32975129
modules:
  ab:
    class: bzt.modules.ab.ApacheBenchmarkExecutor
  android-emulator:
    class: bzt.modules.services.AndroidEmulatorLoader
  apiritif:
    class: bzt.modules.python.ApiritifNoseExecutor
  appium:
    class: bzt.modules.services.AppiumLoader
  blazemeter:
    class: bzt.modules.blazemeter.BlazeMeterUploader
  capturehar:
    class: bzt.modules.blazemeter.ServiceStubCaptureHAR
  chrome-metric-reporter:
    class: bzt.modules.chrome.MetricReporter
  chrome-profiler:
    class: bzt.modules.chrome.ChromeProfiler
    processors:
      trace:
        class: bzt.modules.chrome.TraceProcessor
        extractors:
        - bzt.modules.chrome.TabNameExtractor
        - bzt.modules.chrome.MemoryMetricsExtractor
  cloud:
    class: bzt.modules.blazemeter.CloudProvisioning
    default-location: us-central1-a
  console:
    class: bzt.modules.console.ConsoleStatusReporter
    disable: auto
    screen: console
  consolidator:
    buffer-multiplier: 2
    buffer-scale-choice: 0.5
    class: bzt.modules.aggregator.ConsolidatingAggregator
    generalize-labels: false
    ignore-labels:
    - ignore
    max-buffer-len: .inf
    min-buffer-len: 2
    percentiles:
    - 0.0
    - 50.0
    - 90.0
    - 95.0
    - 99.0
    - 99.9
    - 100.0
    rtimes-len: 1000
  final-stats:
    class: bzt.modules.reporting.FinalStatus
  final_stats:
    class: bzt.modules.reporting.FinalStatus
  functional-consolidator:
    class: bzt.modules.functional.FunctionalAggregator
  gatling:
    class: bzt.modules.gatling.GatlingExecutor
    properties:
      gatling.data.file.bufferSize: 256
  grinder:
    class: bzt.modules.grinder.GrinderExecutor
    properties:
      grinder.useConsole: false
  install-checker:
    class: bzt.modules.services.InstallChecker
  jmeter:
    class: bzt.modules.jmeter.JMeterExecutor
    detect-plugins: true
    download-link: null
    force-ctg: true
    gui: false
    memory-xmx: 4G
    path: /Users/jemal/.bzt/jmeter-taurus/3.3/bin/jmeter.sh
    plugins:
    - jpgc-casutg
    - jpgc-dummy
    - jpgc-ffw
    - jpgc-fifo
    - jpgc-functions
    - jpgc-json
    - jpgc-perfmon
    - jpgc-prmctl
    - jpgc-tst
    properties:
      accountId: 5a2ef7a2e4b043bb0659cddf
      base-uri: http://localhost
      jmeter.save.saveservice.autoflush: 'true'
      jmeter.save.saveservice.connect_time: 'true'
      jmeterengine.force.system.exit: 'true'
      password: '********'
      port: '8080'
      sourceId: 5a4588ffe4b043bb5a947999
      summariser.name: ''
      user-auth: admin:Z00mda1a!
      username: admin
    shutdown-port: 4445
    shutdown-wait: 5
    system-properties: {}
    version: '3.3'
    xml-jtl-flags:
      responseData: true
  junit:
    class: bzt.modules.java.JUnitTester
  junit-xml:
    class: bzt.modules.reporting.JUnitXMLReporter
  local:
    class: bzt.modules.provisioning.Local
    sequential: false
  locust:
    class: bzt.modules.locustio.LocustIOExecutor
  mocha:
    class: bzt.modules.javascript.MochaTester
  molotov:
    class: bzt.modules.molotov.MolotovExecutor
  monitoring:
    class: bzt.modules.monitoring.Monitoring
  newman:
    class: bzt.modules.javascript.NewmanExecutor
  nose:
    class: bzt.modules.python.ApiritifNoseExecutor
  nunit:
    class: bzt.modules.csharp.NUnitExecutor
  passfail:
    class: bzt.modules.passfail.PassFailStatus
  pbench:
    class: bzt.modules.pbench.PBenchExecutor
  proxy2jmx:
    class: bzt.modules.proxy2jmx.Proxy2JMX
  pytest:
    class: bzt.modules.python.PyTestExecutor
  robot:
    class: bzt.modules.python.RobotExecutor
  rspec:
    class: bzt.modules.ruby.RSpecTester
  screenshoter:
    class: bzt.modules.blazemeter.ServiceStubScreenshoter
  selenium:
    class: bzt.modules.selenium.SeleniumExecutor
  shellexec:
    class: bzt.modules.shellexec.ShellExecutor
  siege:
    class: bzt.modules.siege.SiegeExecutor
  testng:
    class: bzt.modules.java.TestNGTester
  tsung:
    class: bzt.modules.tsung.TsungExecutor
  unpacker:
    class: bzt.modules.services.Unpacker
  virtual-display:
    class: bzt.modules.services.VirtualDisplay
  wdio:
    class: bzt.modules.javascript.WebdriverIOExecutor
provisioning: local
reporting:
- dump-csv: null
  dump-xml: null
  failed-labels: false
  module: final-stats
  percentiles: true
  summary: true
  test-duration: true
- module: console
- dump-csv: null
  dump-xml: null
  failed-labels: true
  module: final-stats
  percentiles: true
  summary: true
  test-duration: true
scenarios:
  File Upload using REST API:
    concurrent-pool-size: 4
    content-encoding: null
    data-sources: []
    default-address: null
    disable-listeners: true
    headers: {}
    keepalive: null
    modifications: {}
    properties: {}
    random-source-ip: null
    requests:
    - assert:
      - assume-success: false
        contains:
        - '"succeeded"'
        - '"failed":0'
        not: false
        regexp: false
        subject: body
      assert-jsonpath: []
      assert-xpath: []
      body: null
      body-file: null
      content-encoding: null
      extract-css-jquery: {}
      extract-jsonpath: {}
      extract-regexp: {}
      extract-xpath: {}
      follow-redirects: true
      headers:
        Authorization: Basic ${__base64Encode(${__P(user-auth)})}
      jsr223: []
      keepalive: null
      label: 'uploading '
      method: POST
      random-source-ip: null
      think-time: null
      timeout: null
      upload-files:
      - mime-type: text/csv
        param: fileData
        path: /Users/jemal/jemal-performance-project/performance-taurus/MiscTest.csv
      url: http://${host}:${port}/zoomdata/api/upload/${sourceId}?accountId=${accountId}
    retrieve-resources: true
    retrieve-resources-regex: null
    store-cache: false
    store-cookie: false
    think-time: null
    timeout: null
    use-dns-cache-mgr: false
    variables:
      accountId: 5a2ef7a2e4b043bb0659cddf
      host: localhost
      port: '8080'
      sourceId: 5a4588ffe4b043bb5a947999
services:
- local:
  - metrics:
    - cpu
    - mem
    - bytes-sent
    - bytes-recv
    - disk-read
    - disk-write
    - disk-space
    - engine-loop
    - conn-all
  module: monitoring
  run-at: local
settings:
  aggregator: consolidator
  artifacts-dir: '%Y-%m-%d_%H-%M-%S.%f'
  check-interval: 1
  check-updates: true
  default-executor: jmeter
  proxy: {}
  tab-replacement-spaces: 4
  verbose: false
version: 1.10.3